; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-5)
(:domain blocksworld)
(:objects b1 b2 b3 b4 b5 )
(:init
(arm-empty)
(on b1 b4)
(on b2 b5)
(on-table b3)
(on-table b4)
(on b5 b1)
(clear b2)
(clear b3)
)
(:goal
(and
(on b4 b5)
(on b5 b2))
)
)

; plan
1. (unstack b2 b5)
   deleted: (on b2 b5) (clear b2) (arm-empty)
   added: (holding b2) (clear b5)
   goals met: 0 of 2
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 2
3. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 0 of 2
4. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 1 of 2
5. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 1 of 2
6. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 2
7. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 1 of 2
8. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 2 of 2
